Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/drupal-tm.tmx
Source language: en
Languages: ca_es

source: When working with blocks, remember that all themes do <em>not</em> implement the same regions, or display regions in the same way. Blocks are positioned on a per-theme basis. Users with the <em>Administer blocks</em> permission can disable blocks. Disabled blocks are listed on the <a href="@blocks">Blocks administration page</a>, but are not displayed in any region.
ca_es: Quan treballeu amb blocs, recordeu que <em>no</em> tots els temes implementen les mateixes regions, o mostren les regions de la mateixa manera. Els blocs són col·locats en funció de cada tema. Els usuaris amb el permís <em>Administra els blocs</em> poden inhabilitar blocs. Els blocs inhabilitats es llisten a la <a href="@blocks">pàgina d'administració dels blocs</a>, però no es mostren a cap regió.

source: Controlling visibility
ca_es: Control de la visibilitat

source: Blocks can be configured to be visible only on certain pages, only to users of certain roles, or only on pages displaying certain <a href="@content-type">content types</a>. Administrators can also allow specific blocks to be enabled or disabled by users when they edit their <a href="@user">My account</a> page. Some dynamic blocks, such as those generated by modules, will be displayed only on certain pages.
ca_es: Els blocs poden ser configurats per a ser visibles només en pàgines concretes, només per usuaris d'un rol concret, o només en pàgines que mostrin un determinat <a href="@content-type">tipus de contingut</a>. Els administradors poden permetre que determinats blocs puguin ser habilitats o inhabilitats pels usuaris quan editin la seva pàgina de <a href="@user">El meu compte</a>. Alguns blocs dinàmics, tals com els generats pels mòduls, es mostraran només en algunes pàgines determinades.

source: Creating custom blocks
ca_es: Creació de blocs personalitzats

source: Users with the <em>Administer blocks</em> permission can <a href="@block-add">add custom blocks</a>, which are then listed on the <a href="@blocks">Blocks administration page</a>. Once created, custom blocks behave just like default and module-generated blocks.
ca_es: Els usuaris amb el permís de <em>Administra els blocs</em> poden <a href="@block-add">afegir blocs personalitzats</a>, els quals són llistats a la <a href="@blocks">pàgina d'administració dels blocs</a>. Una vegada creats, els blocs personalitzats es comporten de la mateixa forma que els blocs predeterminats i els generats pels mòduls.

source: Use this page to create a new custom block. New blocks are disabled by default; assign them to a region, on this page or the <a href="@blocks">Blocks administration page</a>, to make them visible.
ca_es: Utilitzeu aquesta pàgina per a crear un nou bloc personalitzat. Els blocs nous estan inhabilitats per defecte; assigneu-los a una regió, en aquesta pàgina o a la <a href="@blocks">pàgina d'administració de blocs</a>, per tal de fer-los visibles.

source: This page provides a drag-and-drop interface for assigning a block to a region, and for controlling the order of blocks within regions. Since not all themes implement the same regions, or display regions in the same way, blocks are positioned on a per-theme basis. Remember that your changes will not be saved until you click the <em>Save blocks</em> button at the bottom of the page. Click the <em>configure</em> link next to each block to configure its specific title and visibility settings.
ca_es: Aquesta pàgina proporciona una interfície d'arrossegar-i-deixar-anar per assignar un bloc a una regió, i per a controlar l'ordre dels blocs dins les regions. Com que no tots els temes implementen les mateixes regions, o mostren les regions de la mateixa forma, els blocs es col·loquen en funció de cada tema. Recordeu que els vostres canvis no es desaran fins que deu clic al botó <em>Desa els blocs</em> situat a la part inferior de la pàgina. Feu clic a l'enllaç <em>configur</em> que apareix al costat de cada bloc per a configurar el seu títol específic i els paràmetres de visibilitat.

source: Demonstrate block regions (@theme)
ca_es: Mostra les regions de bloc (@theme)

source: Administer blocks
ca_es: Administra els blocs

source: A brief description of your block. Used on the <a href="@overview">Blocks administration page</a>.
ca_es: Una breu descripció del vostre bloc. S'utilitza a la <a href="@overview">pàgina d'administració dels blocs</a>.

source: Personalize blocks
ca_es: Personalitza els blocs

source: Blocks consist of content or information that complements the main content of the page. Enable or disable optional blocks using the checkboxes below.
ca_es: Els blocs consisteixen en contingut o informació que complementa el contingut principal de la pàgina. Habiliteu o inhabiliteu els blocs opcionals utilitzant les següents caselles de selecció.

source: Cache blocks
ca_es: Emmagatzema els blocs en memòria cau

source: Block caching is inactive because you have enabled modules defining content access restrictions.
ca_es: La memòria cau de bloc està inactiva perquè heu habilitat mòduls que defineixen restriccions d'accés al contingut.

source: Controls the visual building blocks a page is constructed with. Blocks are boxes of content rendered into an area, or region, of a web page.
ca_es: Controla els blocs de construcció visual amb que està construïda una pàgina. Els blocs són caixes de contingut que es pinten en una àrea o una regió d'una pàgina web.

source: Restricted to certain pages
ca_es: Restringit a certes pàgines

source: The block cannot be placed in this region.
ca_es: No es pot posar el bloc en aquesta regió.

source: Use for multi-user blogs. Every user gets a personal blog.
ca_es: Utilitzeu-ho per a blogs multiusuari. Cada usuari obté un blog personal.

source: The Blog module allows registered users to maintain an online journal, or <em>blog</em>. Blogs are made up of individual <em>blog entries</em>. By default, the blog entries are displayed by creation time in descending order, with comments enabled, and are promoted to the site's front page. For more information, see the online handbook entry for <a href='@blog''>Blog module</a>.
ca_es: El mòdul Blog permet que els usuaris registrats puguin mantenir un diari en línia o <em>blog</em>. Els blogs estan formats per <em>entrades de blog</em> individuals. Per defecte, les entrades de blog es mostren en ordre descendent per data de creació, amb els comentaris habilitats i es promouen automàticament a la pàgina principal del lloc. Per a més informació, aneu a la secció del <a href="@blog">mòdul Blog</a> del manual en línia.

source: Single-user blogs
ca_es: Blogs monousuari

source: Each user's blog entries are automatically displayed with a link to the user's main blog page. You can create as many single-user blogs as you have site users with permission to create blog content.
ca_es: Cada entrada de blog es mostra de forma automàtica amb un enllaç a la pàgina principal del blog de l'usuari. Podeu crear tants blogs monousuari com usuaris tingueu al lloc amb permisos per a crear entrades de blog.

source: Multi-user blogs
ca_es: Blogs multiusuari

source: Blog entries from each single-user blog are also aggregated into one central multi-user blog, which displays the blog content of all users in a single listing.
ca_es: Les entrades de blog de cada blog monousuari s'agrupen també en un blog central multiusuari, el qual mostra els continguts dels blogs de tots els usuaris en un sol llistat.

source: There is an optional <em>Blogs</em> menu item added to the Navigation menu, which displays all blogs available on your site, and a <em>My blog</em> item displaying the current user's blog entries.
ca_es: Hi ha un element opcional de menú anomenat <em>Blogs</em> dins del menú Navegació, que mostra tots els blogs disponibles al vostre lloc, i un altre element anomenat <em>El meu blog</em> que mostra les entrades de blog de l'usuari actual.

source: The Blog module also creates a default <em>Recent blog posts</em> block that may be enabled at the <a href="@blocks">blocks administration page</a>.
ca_es: El mòdul Blog també crea un bloc per defecte anomenat <em>Articles recents del blog</em> que cal habilitar des de la <a href="@blocks">pàgina d'administració de blocs</a>.

source: Create new blog entry
ca_es: Crea una nova entrada del blog

source: Enables multi-user blogs.
ca_es: Habilita els blogs multiusuari.

source: No books available.
ca_es: No hi ha llibres disponibles.

source: Content types allowed in book outlines
ca_es: Tipus de contingut permesos als esquemes de llibre

source: Users with the %outline-perm permission can add all content types.
ca_es: Els usuaris amb el permís %outline-perm poden afegir tots els tipus de contingut.

source: Administer book outlines
ca_es: Administra els esquemes dels llibres

source: The Book module is used for creating structured, multi-page content, such as site resource guides, manuals, and wikis. It allows you to create content that has chapters, sections, subsections, or any similarly-tiered structure. For more information, see the online handbook entry for <a href="@book">Book module</a>.
ca_es: El mòdul Book s'utilitza per a crear contingut estructurat i multipàgina, com ara guies de recursos, manuals i wikis. Us permet crear contingut que tingui capítols, seccions, subseccions o qualsevol d'altre de similar estructurat per nivells. Per a més informació, aneu a la secció del <a href="@book">mòdul Book</a> del manual en línia.

source: Adding and managing book content
ca_es: Afegir i gestionar contingut de llibres

source: You can assign separate permissions for <em>creating</em>, <em>editing</em>, and <em>deleting</em> book content, as well as <em>adding content to books</em>, and <em>creating new books</em>. Users with the <em>Administer book outlines</em> permission can add <em>any</em> type of content to a book by selecting the appropriate book outline while editing the content. They can also view a list of all books, and edit and rearrange section titles on the <a href="@admin-book">Book administration page</a>.
ca_es: Podeu assignar permisos de forma separada per a <em>crear</em>, <em>editar</em> i </em>suprimir</em> contingut de llibre, a més a més, d'<em>afegir contingut als llibres</em> i <em>crear nous llibres</em>. Els usuaris amb permís per <em>administrar els esquemes de llibre</em> poden afegir <em>qualsevol</em> tipus de contingut a un llibre seleccionant l'esquema de llibre apropiat mentre s'edita el contingut. A més a més, poden veure una llista de tots els llibres, i editar i reordenar els títols de les seccions a la <a href="@admin-book">pàgina d'administració de llibres</a>.

source: Book pages have a default book-specific navigation block. This navigation block contains links that lead to the previous and next pages in the book, and to the level above the current page in the book's structure. This block can be enabled on the <a href='@admin-block'>Blocks administration page</a>. For book pages to show up in the book navigation, they must be added to a book outline.
ca_es: Les pàgines de llibre tenen un bloc de navegació per defecte específica dels llibres. Aquest bloc de navegació conté enllaços que porten a les pàgines anteriors i posteriors del llibre, així com al nivell superior de la pàgina actual dins de l'estructura del llibre. Aquest bloc es pot habilitar a la <a href="@admin-block">pàgina d'administració de llibres</a>. Per a que les pàgines de llibre es mostrin en la seva navegació, cal que aquestes s'afegeixin a un esquema.

source: Books can be created collaboratively, as they allow users with appropriate permissions to add pages into existing books, and add those pages to a custom table of contents menu.
ca_es: Els llibres es poden crear de forma col·laborativa, ja que permeten als usuaris amb els permisos apropiats d'afegir pàgines a un llibre existent, i afegir-les a un menú personalitzat de taula de continguts.

source: Printing books
ca_es: Impressió de llibres

source: Users with the <em>View printer-friendly books</em> permission can select the <em>printer-friendly version</em> link visible at the bottom of a book page's content to generate a printer-friendly display of the page and all of its subsections.
ca_es: Els usuaris amb el permís de <em>Veure llibres per imprimir</em> poden seleccionar l'enllaç <em>versió per a imprimir</em> visible a la part inferior de la pàgina de contingut d'un llibre per a generar una vista per a imprimir de la pàgina i totes les seves subseccions.

source: The book module offers a means to organize a collection of related content pages, collectively known as a book. When viewed, this content automatically displays links to adjacent book pages, providing a simple navigation system for creating and reviewing structured content.
ca_es: El mòdul book ofereix una forma d'organitzar una col·lecció de pàgines de contingut relacionades, col·lectivament conegudes com a llibre. Quan es consulta, aquest contingut mostra automàticament enllaços a les pàgines adjacents del llibre, proporcionant un sistema de navegació simple per a la creació i revisió de contingut estructurat.

source: The outline feature allows you to include pages in the <a href="@book">Book hierarchy</a>, as well as move them within the hierarchy or to <a href="@book-admin">reorder an entire book</a>.
ca_es: La funcionalitat d'esquema us permet incloure pàgines a la <a href="@book">Jerarquia del llibre</a>, així com moure-les dins de la jerarquia o <a href="@book-admin">reordenar un llibre sencer</a>.

source: Create new books
ca_es: Crea nous llibres

source: Add content and child pages to books
ca_es: Afegeix contingut i pàgines filles als llibres

source: View printer-friendly books
ca_es: Accedeix a la versió per a imprimir dels llibres

source: View a book page and all of its sub-pages as a single document for ease of printing. Can be performance heavy.
ca_es: Accediu a una pàgina d'un llibre i a totes les seves subpàgines com un sol document per a facilitar-ne la impressió. Pot ser pesat en temes de rendiment.

source: <em>Books</em> have a built-in hierarchical navigation. Use for handbooks or tutorials.
ca_es: Els <em>llibres</em> tenen una jerarquia de navegació interna. Utilitzeu-los per a manuals o tutorials.

source: Allows users to create and organize related content in an outline.
ca_es: Permet als usuaris crear i organitzar contingut relacionat en un esquema.

source: The Color module allows users with the <em>Administer site configuration</em> permission to quickly and easily change the color scheme of themes that have been built to be compatible with it. For more information, see the online handbook entry for <a href="@color">Color module</a>.
ca_es: El mòdul Color permet als usuaris amb el permís <em>Administra la configuració del lloc</em> canviar de forma ràpida i fàcil l'esquema de colors dels temes que han estat construïts per a ser compatibles amb aquest mòdul. Per a més informació, aneu a la secció del <a href="@color">mòdul Color</a> del manual en línia.

source: Changing colors
ca_es: Canvi de colors

source: Using the Color module allows you to easily change the color of links, backgrounds, text, and other theme elements. To change the color settings for a compatible theme, select the <em>Settings</em> link for your theme on the <a href='@configure'>Themes administration page</a>. If you don't see a color picker on that page, then your theme is not compatible with the color module. If you are sure that the theme does indeed support the color module, but the color picker does not appear, then <a href='@troubleshoot'>follow these troubleshooting procedures</a>.
ca_es: Utilitzant el mòdul Color us permet canviar fàcilment el color dels enllaços, del fons, del text i d'altres elements del tema. Per canviar els paràmetres de color d'un tema compatible, aneu a l'enllaç <em>Paràmetres</em> del vostre tema a la <a href="@configure">pàgina d'administració de temes</a>. Si no veieu un selector de color en aquesta pàgina, llavors els vostre tema no és compatible amb el mòdul color. Si esteu segurs que el vostre tema té suport pel mòdul color, però el selector de color no apareix, llavors <a href="@troubleshoot">seguiu aquests procediments de solució de problemes</a>.

source: The Color module saves a modified copy of the theme's specified stylesheets in the files directory. This means that if you make any manual changes to your theme's stylesheet, <em>you must save your color settings again, even if they haven't changed</em>. This step is required because the module stylesheets (in the files directory) need to be recreated to include your changes.
ca_es: El mòdul Color desa una còpia modificada dels fulls d'estils especificats del tema al directori de fitxers. Això vol dir que si feu cap canvi manual als fulls d'estil del vostre tema, <em>haureu de desar els vostres paràmetres de color un altre cop, encara que aquests no hagin canviat</em>. Aquest pas és obligatori perquè els fulls d'estils dels mòduls (al directori de fitxers) cal que es tornin a crear per incloure els vostres canvis.

source: The GD library for PHP is enabled, but was compiled without PNG support. Check the <a href="@url">PHP image documentation</a> for information on how to correct this.
ca_es: La biblioteca GD per PHP està habilitada, però fou compilada sense suport per PNG. Comproveu la <a href="@url">documentació d'imatge de PHP</a> per a més informació de com corregir això.

source: The GD library for PHP is missing or outdated. Check the <a href="@url">PHP image documentation</a> for information on how to correct this.
ca_es: La biblioteca GD per PHP no es troba o està desfasada. Comproveu la <a href="@url">documentació d'imatge de PHP</a> per a més informació de com corregir això.

source: Allows administrators to change the color scheme of compatible themes.
ca_es: Permet als administradors canviar l'esquema de color dels temes compatibles.

source: Select one or more comments to perform the update on.
ca_es: Seleccioneu un o més comentaris per tal de dur-hi a terme l'actualització.

source: There do not appear to be any comments to delete, or your selected comment was deleted by another administrator.
ca_es: Sembla ser que no hi ha cap comentari per eliminar, o bé el comentari que heu seleccionat ha estat eliminat per un altre administrador.

source: Deleted @count comments.
ca_es: S'han suprimit @count comentaris.

source: Deleted comment @cid and its replies.
ca_es: S'ha suprimit el comentari @cid i les seves respostes.

source: Comment approved.
ca_es: Comentari aprovat.

source: Tokens for comments posted on the site.
ca_es: Tokens per als comentaris enviats al lloc

source: The Comment module allows users to comment on site content, set commenting defaults and permissions, and moderate comments. For more information, see the online handbook entry for <a href="@comment">Comment module</a>.
ca_es: El mòdul Comment permet als usuaris comentar el contingut del lloc, establir els paràmetres predeterminats i els permisos, i moderar els comentaris. Per a més informació, aneu a la secció del <a href="@comment">mòdul Comment</a> del manual en línia.

source: Default and custom settings
ca_es: Paràmetres predeterminats i personalitzats

source: Each <a href='@content-type'>content type</a> can have its own default comment settings configured as: <em>Open</em> to allow new comments, <em>Hidden</em> to hide existing comments and prevent new comments, or <em>Closed</em> to view existing comments, but prevent new comments. These defaults will apply to all new content created (changes to the settings on existing content must be done manually). Other comment settings can also be customized per content type, and can be overridden for any given item of content. When a comment has no replies, it remains editable by its author, as long as the author has a user account and is logged in.
ca_es: Cada <a href="@content-type">tipus de contingut</a> pot tenir els seus propis paràmetres predeterminats de comentari com: <em>Obert</em> per a permetre nous comentaris, <em>Ocult</em> per a ocultar els comentaris existents i evitar nous comentaris, o <em>Tancat</em> per a mostrar els comentaris existents, però evitar els nous comentaris. Aquests valors predeterminats aplicaran als nous comentaris que es creïn (els canvis als paràmetres de contingut existent s'ha de fer manualment). D'altres paràmetres dels comentaris es poden personalitzar per tipus de contingut, i poden ser sobreescrits per qualsevol element de contingut. Quan un comentari no té respostes, segueix sent editable pel seu autor, sempre i quan l'autor tingui un compte d'usuari i hagi iniciat sessió.

source: Comments from users who do not have the <em>Post comments without approval</em> permission are placed in the <a href='@comment-approval'>Unapproved comments</a> queue, until a user who has permission to <em>Administer comments</em> moderates them as either published or deleted. Published comments can be bulk managed on the <a href='@admin-comment'>Published comments</a> administration page.
ca_es: Els comentaris dels usuaris que no tenen el permís <em>Envia comentaris sense aprovació</em> es col·loquen a la cua de <em>comentaris sense aprovar</em>, fins que un usuari amb el permís <em>Administra els comentaris</em> els moderi com a publicats o suprimits. Els comentaris publicats es poden gestionar a granel des de la pàgina d'administració de <a href='@admin-comment'>comentaris publicats</a>.

source: Full comment
ca_es: Comentari complet

source: Unapproved comments (@count)
ca_es: Comentaris sense aprovar (@count)

source: Administer comments and comment settings
ca_es: Administra els comentaris i els paràmetres de comentari

source: Post comments with approval
ca_es: Envia comentaris amb aprovació

source: Post comments without approval
ca_es: Envia comentaris sense aprovació

source: Edit own comments
ca_es: Edita els comentaris propis

source: Number of recent comments
ca_es: Nombre de comentaris recents

source: Threading
ca_es: En fils

source: Show comment replies in a threaded list.
ca_es: Mostreu les respostes dels comentaris en una llista amb fils.

source: Default comment setting for new content
ca_es: Paràmetre predeterminat del comentari per al nou contingut

source: Allow comment title
ca_es: Permet títol als comentaris

source: Show reply form on the same page as comments
ca_es: Mostra el formulari de resposta a la mateixa pàgina que els comentaris

source: Users with the "Post comments" permission can post comments.
ca_es: Els usuaris amb el permís "Envia comentaris" poden enviar comentaris.

source: Users cannot post comments, but existing comments will be displayed.
ca_es: Els usuaris no poden enviar comentaris, però es mostraran els comentaris existents.

source: Comments are hidden from view.
ca_es: Els comentaris estan ocults a la vista.

source: Users cannot post comments.
ca_es: Els usuaris no poden enviar comentaris.

source: Your comment has been queued for review by site administrators and will be published after approval.
ca_es: El vostre comentari s'ha posat a la cua per a que un administrador del lloc el revisi i el publicarà després de la seva aprovació.

source: Your comment has been posted.
ca_es: S'ha enviat el vostre comentari.

source: <a href="@login">Log in</a> or <a href="@register">register</a> to post comments
ca_es: <a href="@login">Inicieu sessió</a> o <a href="@register">registreu-vos</a> per a enviar comentaris

source: <a href="@login">Log in</a> to post comments
ca_es: <a href="@login">Inicieu sessió</a> per a enviar comentaris

source: Flat list
ca_es: Llista plana

source: Threaded list
ca_es: Llista amb fils

source: Save comment
ca_es: Desa el comentari
